app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Data Science"], ["room_number", 7], ["created_at", "2021-10-06 21:41:47.585594"], ["updated_at", "2021-10-06 21:41:47.585594"]]
---
    def create
        @school_class = SchoolClass.new(school_class_params)
        @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 3], ["updated_at", "2021-10-06 21:43:16.409380"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_class_params)